performance-test/cloudflare-load-test.yml
config:
  target: 'https://hubspot-forms-sveltekit.pages.dev'
  phases:
    ## 5 users per second for 60 seconds.
    ## 2 Hubspot requests per user (GET + POST) for a total of 100 requests/10 seconds (RATE LIMIT)
    - duration: 60
      arrivalRate: 5
      name: Sustained load
    ## 10 users per second for 5 seconds
    ## 2 Hubspot requests per user (GET + POST) for a total of 100 requests/10 seconds (RATE LIMIT)
    - duration: 5
      arrivalRate: 10
      name: Medium burst load
    ## 50 users per second for 1 seconds
    ## 2 Hubspot requests per user (GET + POST) for a total of 100 requests/10 seconds (RATE LIMIT)
    - duration: 1
      arrivalRate: 50
      name: Large burst load
  engines:
    playwright: {}
  processor: flows/cloudflare-load-test.js
scenarios:
  - name: 'Cloudflare form submission'
    engine: playwright
    flowFunction: 'formSubmissionTest'
    flow: []